tutorials/multiCompressionFoam/RiemannTube/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: dualFuelEngine addition to OpenFOAM v8
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.5.x-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default           Euler;
}

gradSchemes
{
    default           Gauss linear;
    grad(p)           cellLimited Gauss linear 0.9; // UEqn
}

divSchemes
{
    default           none;
    div(phi,U)        Gauss upwind;
    div(U)            Gauss linear;
    div(phi,e)        Gauss limitedLinear 1;
    div(phi,K)        Gauss limitedLinear 1;
    div(phiv,p)       Gauss limitedLinear 1;
    div((kappa*grad(T))) Gauss linear;
    div((p*U))        Gauss linear;
    "div\(phi,alpha.*\)" Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //